app/controllers/api/v1/department_posts_controller.rb

  def index
    @posts = DepartmentPost.includes(:author, :comments).recent
    @posts = @posts.by_department(params[:department]) if params[:department].present?
    @posts = @posts.by_category(params[:category]) if params[:category].present?

    render json: {
      status: 'success',
      data: @posts.map do |post|
---
SELECT "department_posts".* FROM "department_posts" ORDER BY "department_posts"."created_at" DESC
SELECT "department_posts".* FROM "department_posts" WHERE "department_posts"."category" = 'work_share' ORDER BY "department_posts"."created_at" DESC