app/controllers/api/v1/documents_controller.rb

SELECT "documents".* FROM "documents" ORDER BY "documents"."updated_at" DESC
---
  def index
    @documents = Document.includes(:author, :approvals).recent

    # 필터링
    @documents = @documents.by_author(@current_user) if params[:my_documents] == 'true'
    @documents = @documents.by_status(params[:status]) if params[:status].present?
    @documents = @documents.by_type(params[:document_type]) if params[:document_type].present?
    @documents = @documents.by_department(params[:department]) if params[:department].present?

    # 결재 대기 문서 (내가 결재해야 할 문서)
    if params[:pending_approval] == 'true'
      @documents = @documents.joins(:approvals)
                             .where(approvals: { approver: @current_user, status: 'pending' })
    end

    render json: {
      status: 'success',
      data: @documents.map do |document|