app/controllers/api/v1/employees_controller.rb

  def index
    # N+1 쿼리 방지를 위한 includes 및 캐싱
    @employees = Employee.includes(:attendances, :leave_requests, :payrolls)
                        .select(:id, :name, :department, :position, :employment_type,
                               :hire_date, :phone, :email, :status, :base_salary,
                               :hourly_rate, :salary_type, :created_at, :updated_at)

    # 필터링
    @employees = @employees.where(department: params[:department]) if params[:department].present?
    @employees = @employees.where(status: params[:status]) if params[:status].present?
    @employees = @employees.where(employment_type: params[:employment_type]) if params[:employment_type].present?

    # 검색
    if params[:search].present?
      @employees = @employees.where("name ILIKE ? OR email ILIKE ?", "%#{params[:search]}%", "%#{params[:search]}%")
    end

    @employees = @employees.order(:name)

    render json: {
      employees: @employees.map do |employee|
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."employee_id" IN (7, 1, 12, 3, 9, 8, 2, 10, 5, 11, 4, 6)
SELECT "employees"."id", "employees"."name", "employees"."department", "employees"."position", "employees"."employment_type", "employees"."hire_date", "employees"."phone", "employees"."email", "employees"."status", "employees"."base_salary", "employees"."hourly_rate", "employees"."salary_type", "employees"."created_at", "employees"."updated_at" FROM "employees" ORDER BY "employees"."name" ASC
SELECT "leave_requests".* FROM "leave_requests" WHERE "leave_requests"."employee_id" IN (7, 1, 12, 3, 9, 8, 2, 10, 5, 11, 4, 6)
SELECT "payrolls".* FROM "payrolls" WHERE "payrolls"."employee_id" IN (7, 1, 12, 3, 9, 8, 2, 10, 5, 11, 4, 6)
SELECT "employees".* FROM "employees" ORDER BY "employees"."name" ASC